IRP/src/Tasks/ExecutorTask/ExecutorTask.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ExecutorTask</name>
  <addressing>InformationRegister.TaskExecutors</addressing>
  <attributes>
    <name>Detailing</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionObject</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AcceptetionForExecutionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>CurrentExecutor</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>UserGroup</name>
    <type>
      <types>CatalogRef.UserGroups</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Position</name>
    <type>
      <types>CatalogRef.EmployeePositions</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ProfitLossCenter</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

IRP/src/Enums/FormTypes/FormTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>FormTypes</name>
 <enumValues>
  <name>ObjectForm</name>
 </enumValues>
 <enumValues>
  <name>ListForm</name>
 </enumValues>
 <enumValues>
  <name>ChoiceForm</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Tasks/ExecutorTask/Forms/ItemForm/Module.bsl
// @strict-types

#Region FormEvents

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	FormNamesArray = StrSplit(ThisObject.FormName, ".");
	CatalogFullName = FormNamesArray[0] + "." + FormNamesArray[1];
	
	ExternalCommandsServer.CreateCommands(ThisObject, CatalogFullName, Enums.FormTypes.ObjectForm);
	InternalCommandsServer.CreateCommands(ThisObject, Object, CatalogFullName, Enums.FormTypes.ObjectForm);
	
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	
	SetVisible();
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	SetVisible();
EndProcedure

#EndRegion

#Region FormItemsEvents

// Description opening.
// 
// Parameters:
//  Item - FormField - Item
//  StandardProcessing - Boolean - Standard processing
&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	If Object.Ref.IsEmpty() Then
		LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
	EndIf;
EndProcedure

&AtClient
Procedure AcceptForExecution(Command)
	AcceptForExecutionServer();
EndProcedure

#EndRegion

#Region COMMANDS

// Generated form command action by name.
// 
// Parameters:
//  Command - FormCommand - Command
&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	ExternalCommandsClient.GeneratedFormCommandActionByName(Object, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name);
EndProcedure

// Generated form command action by name server.
// 
// Parameters:
//  CommandName - String - Command name
&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName) Export
	ExternalCommandsServer.GeneratedFormCommandActionByName(Object, ThisObject, CommandName);
EndProcedure

// Internal command action.
// 
// Parameters:
//  Command - FormCommand - Command
&AtClient
Procedure InternalCommandAction(Command) Export
	InternalCommandsClient.RunCommandAction(Command, ThisObject, Object, Object.Ref);
EndProcedure

// Internal command action with server context.
// 
// Parameters:
//  Command - FormCommand - Command
&AtClient
Procedure InternalCommandActionWithServerContext(Command) Export
	InternalCommandActionWithServerContextAtServer(Command.Name);
EndProcedure

// Internal command action with server context at server.
// 
// Parameters:
//  CommandName - String - Command name
&AtServer
Procedure InternalCommandActionWithServerContextAtServer(CommandName)
	InternalCommandsServer.RunCommandAction(CommandName, ThisObject, Object, Object.Ref);
EndProcedure

#EndRegion

#Region Other

&AtServer
Procedure SetVisible()
	
	Items.UserGroup.Visible = Not Object.UserGroup.IsEmpty();
	Items.Position.Visible = Not Object.Position.IsEmpty();
	Items.Branch.Visible = Not Object.Branch.IsEmpty();
	Items.ProfitLossCenter.Visible = Not Object.ProfitLossCenter.IsEmpty();
	
	ThisObject.Items.FormAcceptForExecution.Visible = Object.CurrentExecutor.IsEmpty();
	
EndProcedure

&AtServer
Procedure AcceptForExecutionServer()
	
	Object.CurrentExecutor = SessionParameters.CurrentUser;
	Object.AcceptetionForExecutionDate = CommonFunctionsServer.GetCurrentSessionDate();
	
	Write();
	
EndProcedure

#EndRegion
